app/views/shared/_my-goal-card.html.erb

SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 449]]
---
<% current_user.goals.each do |goal| %>