app/views/pages/dashboard.html.erb

        <div class="row">
          <% if current_user.goals.any? %>
---
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 449]]
SELECT  1 AS one FROM "goals" WHERE "goals"."user_id" = $1 LIMIT $2  [["user_id", 449], ["LIMIT", 1]]