app/views/goals/new.html.erb

        <%#= f.input :subject, placeholder: "What subject it belongs to?"%>
        <%= f.association :subject, collection: Subject.all, promt: "A qué area pertenece?" %>
---
SELECT "subjects".* FROM "subjects"